Exercise 7.1

In [1]:
import pandas as pd
dat = pd.DataFrame({'features':[0.2, 1, 3.4], 'labels':[0,1,2]})

In [2]:
dat.rename(columns={'labels':'label'})

   features  label
0       0.2      0
1       1.0      1
2       3.4      2

In [11]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [14]:
setosa = iris[iris.species=='setosa']
setosa.species.value_counts()

setosa    50
Name: species, dtype: int64

In [20]:
boolInd = len(iris[(iris.petal_length<=1.4) | (iris.petal_length>=1.6)])
print(boolInd)

137

In [30]:
iris['min_petal'] = iris[['petal_length','petal_width']].apply(lambda x: min(x.petal_width,x.petal_length), axis =1)

In [32]:
import numpy as np
pd.pivot_table(iris, values = ["sepal_width","petal_width"],columns=["species"],aggfunc= [np.mean, np.median])

              mean                      median
species     setosa versicolor virginica setosa versicolor virginica
petal_width  0.246      1.326     2.026    0.2        1.3       2.0
sepal_width  3.428      2.770     2.974    3.4        2.8       3.0

In [35]:
df1 = pd.DataFrame({'first name':['Aubrey','Nick','Griffin'],'age':[30,40,50]})
df2 = pd.DataFrame({'first name':['Aubrey','Jose','Griffin'],'gender':['female','male','male']})

In [39]:
df3 = pd.merge(df1,df2,how='inner')
df3

  first name  age  gender
0     Aubrey   30  female
1    Griffin   50    male

In [41]:
df4 = pd.merge(df1,df2,how='outer')
df4

  first name   age  gender
0     Aubrey  30.0  female
1       Nick  40.0     NaN
2    Griffin  50.0    male
3       Jose   NaN    male

In [44]:
series1 = pd.Series([1,1,2,3,5,8])
seriesArr = series1

AttributeError: 'Series' object has no attribute 'data'